Repository: CarboniDavide/discovery-light
Catalog: UI/DeviceControls/DeviceDataControls/_MemoryDeviceDataControl.*.resx
Languages: it

# lbl_BlockSerial.Text
source: Serail number
it: Numero seriale

# lbl_BlockNumberParty.Text
source: Party number
it: Numero identificativo

# lbl_BlockLocation.Text
source: Location
it: Posto

# lbl_BlockBusSize.Text
source: Bus size
it: Dimmensione del bus

# lbl_BlockSpeed.Text
source: Speed
it: Velocità

# lbl_BlockManufacturer.Text
source: Producer
it: Produttore

# lbl_BlockSize.Text
source: Block size
it: Dimmensione modulo

# lbl_Type.Text
source: Type
it: Tipo

# lbl_Block.Text
source: Bloks
it: Moduli

# lbl_Size.Text
source: Size
it: Dimmensione

# lbl_BlockVoltage.Text
source: Min voltage
it: Voltaggio minimo
